<?php
	$str_in = htmlentities($_GET['str_in']);
	$lang = $_GET['lang'];
	$digits = [
		"ru" => [
			["","один","два","три","четыре","пять","шесть","семь","восемь","девять","десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"],
			["","десять","двадцать","тридцать","сорок","пятьдесят","семьдесят","восемдесят","девяноста"],
			["","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"]
		],
		"en" => ["","one","two","three","four","five","six","seven","eight","nine"]
	];
	$words = [
		["","тысяча","миллион","миллиард","триллион","квадриллион","квинтиллион"],
		["","тысячи","миллиона","миллиарда","триллиона","квадриллиона","квинтиллиона"],
		["","тысяч","миллионов","миллиардов","триллионов","квадриллионов","квинтиллионов"]
	];
	$len = strlen($str_in);
	$pos = $len;
	$word="";
	for ($i=0; $i < $len; $i++) {
		$digit = 1 * substr($str_in, $i, 1);
		if ($digit==1 && ($len-1-$i)%3==1) {
			$i++;
			$digit = 1 * substr($str_in, $i, 1);
			$digit+=10;
		}
		if ($pos>0 && ($len-1-$i)%3==0){
			if ($digit > 1 && $digit < 5) {
				$case = 1;
			}
			elseif ($digit >= 5) {
				$case = 2;
			}
			else{
				$case = 0;
			}
			$word = $words[$case][intdiv($pos-1,3)];
			$pos = $len-$i-1;
		}
		echo $digits[$lang][($len-1-$i)%3][$digit]." ".$word." ";
		$word="";
	}
	for ($i=$len-1; $i >= 0; $i--) { 
		if (($len-$i)%3==0) {
			$str_in=substr_replace($str_in, " ", $i,0);	
		}
	}
	echo "<br>$str_in";

	echo "<br><a href='index.html'>Home</a>";